# RebarShapeConstraintAngleFromFixedDir Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraintAngleFromFixedDir Members
RebarShapeConstraintAngleFromFixedDir Class Constructors Methods Properties See Also
---
The RebarShapeConstraintAngleFromFixedDir type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraintAngleFromFixedDir | Create an angular constraint. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RebarShapeConstraint.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParamId | Return the Id of the parameter associated with this constraint.  (Inherited from RebarShapeConstraint.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Direction | A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |
| Sign | When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise. |

# See Also
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace